src/integ-test/bdd-test/features/flows/TestFlusso_activateIOPayment_ko_closePaymentV1_ok_spo_ok

Feature:  flow checks for closePayment-v1 request - activateIOPayment KO, closePayment-v1 OK and sendPaymentOutcome OK [FLUSSO_CP_25]
 
  Background:
    Given systems up 
    And EC new version
    
   # verifyPaymentNotice phase
    Scenario: Execute verifyPaymentNotice request
    Given initial XML verifyPaymentNotice soap-request
    
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:verifyPaymentNoticeReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
          </nod:verifyPaymentNoticeReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    
    When psp sends SOAP verifyPaymentNotice to nodo-dei-pagamenti
    Then check outcome is OK of verifyPaymentNotice response
    
   # activateIOPaymentReq phase
    Scenario: Execute activateIOPayment request
    Given initial XML activateIOPayment soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForIO.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activateIOPaymentReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <!--Optional:-->
             <idempotencyKey>#idempotency_key#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
             <!--Optional:-->
             <expirationTime>60000</expirationTime>
             <amount>10.00</amount>
             <!--Optional:-->
             <dueDate>2021-12-12</dueDate>
             <!--Optional:-->
             <paymentNote>responseFull</paymentNote>
             <!--Optional:-->
             <payer>
                <uniqueIdentifier>
                   <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                   <entityUniqueIdentifierValue>77777777777</entityUniqueIdentifierValue>
                </uniqueIdentifier>
                <fullName>IOname_#idempotency_key#</fullName>
                <!--Optional:-->
                <streetName>IOstreet</streetName>
                <!--Optional:-->
                <civicNumber>IOcivic</civicNumber>
                <!--Optional:-->
                <postalCode>IOcode</postalCode>
                <!--Optional:-->
                <city>IOcity</city>
                <!--Optional:-->
                <stateProvinceRegion>IOstate</stateProvinceRegion>
                <!--Optional:-->
                <country>IT</country>
                <!--Optional:-->
                <e-mail>IO.test.prova@gmail.com</e-mail>
             </payer>
          </nod:activateIOPaymentReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activateIOPayment to nodo-dei-pagamenti
    And pa sends paGetPaymentResponse wrong
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <paf:paGeBPAYmentRes>
             <outcome>KO</outcome>
             <!--Optional:-->
             <fault>
                <faultCode>PAA_SEMANTICA</faultCode>
                <faultString>chiamata rifiutata</faultString>
                <id>1</id>
                <!--Optional:-->
                <description>chiamata rifiutata</description>
             </fault>
          </paf:paGeBPAYmentRes>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    Then check outcome is KO of activateIOPayment response
    
              
    # nodoChiediInformazioniPagamento phase NB. il paymentToken è preso dalla POSITION_ACTIVATE con noticeNumber e fiscalCode dell'activateIOPayment
    Scenario: Execute a nodoChiediInformazioniPagamento request
    Given initial json nodoChiediInformazioniPagamento
    """
        {"idPagamento": "254bc7a8efd84224a80be30ec7c4bb60"}
    """
    When PM sends nodoChiediInformazioniPagamento to nodo-dei-pagamenti
    Then check errorCode is 404
    And check error is 'Il pagamento non esiste'
    
    # closePayment-v1 request phase  NB. il paymentToken è preso dalla POSITION_ACTIVATE con noticeNumber e fiscalCode dell'activateIOPayment
    Scenario: Execute a closePayment-v1 request
    Given initial json closePayment-v1
    """
        {"paymentTokens": [
            "$activateIOPaymentResponse.paymentToken"
            ],
        "outcome": "KO",
        "identificativoPsp": "70000000001",
        "tipoVersamento": "BPAY",
        "identificativoIntermediario": "70000000001",
        "identificativoCanale": "70000000001_03",
        "pspTransactionId": "18460845",
        "totalAmount": 12.00,
        "fee": 2.00,
        "timestampOperation": "2033-04-23T18:25:43Z",
        "additionalPaymentInformations": {
              "transactionId": "16113941",
              "outcomePaymentGateway": "EFF",
              "authorizationCode": "resOK"
            }
        }  
    """

    When PM sends closePayment-v1 to nodo-dei-pagamenti
    Then check esito is KO 
    And check descrizione is 'Il Pagamento indicato non esiste'
    And check errorCode is 404
    
    # sendPaymentOutcomeReq phase  NB. il paymentToken è preso dalla POSITION_ACTIVATE con noticeNumber e fiscalCode dell'activateIOPayment
     Scenario: Execute sendPaymentOutcome request
     Given the closePayment-v1 scenario executed successfully
     Given initial XML sendPaymentOutcome
     """
     <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:sendPaymentOutcomeReq>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_03</idChannel>
             <password>pwdpwdpwd</password>
             <paymentToken>254bc7a8efd84224a80be30ec7c4bb60</paymentToken>
             <outcome>OK</outcome>
             <!--Optional:-->
             <details>
                <paymentMethod>creditCard</paymentMethod>
                <!--Optional:-->
                <paymentChannel>app</paymentChannel>
                <fee>2.00</fee>
                <!--Optional:-->
                <payer>
                   <uniqueIdentifier>
                      <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                      <entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
                   </uniqueIdentifier>
                   <fullName>SPOname_$activateIOPaymentResponse.paymentToken</fullName>
                   <!--Optional:-->
                   <streetName>SPOstreet</streetName>
                   <!--Optional:-->
                   <civicNumber>SPOcivic</civicNumber>
                   <!--Optional:-->
                   <postalCode>SPOpostal</postalCode>
                   <!--Optional:-->
                   <city>SPOcity</city>
                   <!--Optional:-->
                   <stateProvinceRegion>SPOstate</stateProvinceRegion>
                   <!--Optional:-->
                   <country>IT</country>
                   <!--Optional:-->
                   <e-mail>SPOprova@test.it</e-mail>
                </payer>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
             </details>
          </nod:sendPaymentOutcomeReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    When psp sends sendPaymentOutcome to nodo-dei-pagamenti
    Then check outcome is KO
    And check faultCode is PPT_TOKEN_SCONOSCIUTO
    And check description is 'token unknown'
 
    